src/cf/InformationRegisters/ШтрихкодыЗаказы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ШтрихкодыЗаказы</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СтатусПеревозки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусПеревозки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Распечатан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратсОтметкойПокупателя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/_5LB_Взаимодействие/Ext/Module.bsl
//{+Добавления} Автор: Тасмаджиев 16/07/2018// ->>
Процедура ПоискПТУПоШтрихкоду() Экспорт
	#Если Клиент Тогда
		Перем Результат;
		Результат = "";
		Пока ВвестиСтроку(Результат, "Введите штрихкод") Цикл
			Если РольДоступна("_5LB_Перемещение_товаров_магазин")ИЛИ РольДоступна("_5LB_Перемещение_товаров_склад") Тогда
				Если ЗначениеЗаполнено(Результат) Тогда
					Запрос = Новый Запрос;
					Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
					             |	ПоступлениеТоваровУслуг.Ссылка КАК Документ,
					             |	ВЫБОР
					             |		КОГДА ПоступлениеТоваровУслуг.ДокументОснование ССЫЛКА Документ.РеализацияТоваровУслуг
					             |			ТОГДА ПоступлениеТоваровУслуг.ДокументОснование
					             |		ИНАЧЕ ВЫБОР
					             |				КОГДА ПоступлениеТоваровУслуг.Сделка ССЫЛКА Документ.РеализацияТоваровУслуг
					             |					ТОГДА ПоступлениеТоваровУслуг.Сделка
					             |			КОНЕЦ
					             |	КОНЕЦ КАК Основание
					             |ИЗ
					             |	РегистрСведений.ШтрихкодыЗаказы КАК Р
					             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
					             |		ПО (Р.Владелец = ПоступлениеТоваровУслуг.ДокументОснование
					             |				ИЛИ Р.Владелец = ПоступлениеТоваровУслуг.Сделка)
					             |ГДЕ
					             |	Р.Штрихкод = &Штрих";
					Запрос.УстановитьПараметр("Штрих",Результат);
					
					Рез = Запрос.Выполнить();
					Если Рез.Пустой() Тогда
						Сообщить ("Штрих-код "+Результат+" не найден");
						возврат;
					КонецЕсли;
					
					Выб = Рез.Выбрать();
					
					Если Выб.Количество()<>1 Тогда
						
						Сообщить ("Нарушение штрих-кодирования заказов! Обратитесь к руководству!");
						
					Иначе
						
						Выб.Следующий();
						Док = Выб.Документ;
						Основание =  Выб.Основание;
						Параметр = Новый Структура("Основание",Основание);
						ПоказатьВопрос(Новый ОписаниеОповещения("ПослеЗакрытияВопроса",_5LB_Взаимодействие,Параметр),
						"Вы принимаете документ по грузовым местам ?",
						РежимДиалогаВопрос.ДаНетОтмена,
						0, // таймаут в секундах
						КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
						"ВНИМАНИЕ" // (необ.) заголовок
						);    
							
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	#КонецЕсли
	
КонецПроцедуры  //{-Добавления} Автор: Тасмаджиев 16/07/2018// <<-
				
//{+Добавления} Автор: Тасмаджиев 16/07/2018// ->> 
&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметр) Экспорт
 
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Основание = Параметр.Основание;
		
		Если ТипЗнч(Основание)=Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			
			Если РольДоступна("_5LB_Перемещение_товаров_магазин")Тогда
				
				Документ = Основание.ПолучитьОбъект();
				Документ._5LB_СтатусПеревозки = Перечисления.СтатусПеревозки.Принят;
				Документ.Записать(РежимЗаписиДокумента.Запись);
				
			ИначеЕсли РольДоступна("_5LB_Перемещение_товаров_склад") Тогда
				
				Документ = Основание.ПолучитьОбъект();
				Документ._5LB_СтатусПеревозки = Перечисления.СтатусПеревозки.ВозвратсОтметкойПокупателя;
				Документ.Записать(РежимЗаписиДокумента.Запись);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры  //{-Добавления} Автор: Тасмаджиев 16/07/2018// <<-
